import streamlit as st
import pandas as pd
import numpy as np
import requests
import time
import math
import folium
from folium import plugins
from streamlit_folium import st_folium
import urllib.request
import os
import matplotlib.font_manager as fm
import matplotlib.pyplot as plt

# =====================================================================
# 🛠️ 1. การตั้งค่าทรัพยากรและฟอนต์ภาษาไทย (Font Configuration)
# =====================================================================
@st.cache_resource
def setup_thai_font():
    font_url = "https://github.com/Phonbopit/sarabun-webfont/raw/master/fonts/thsarabunnew-webfont.ttf"
    font_path = "thsarabunnew-webfont.ttf"
    if not os.path.exists(font_path):
        urllib.request.urlretrieve(font_url, font_path)
    fm.fontManager.addfont(font_path)
    plt.rcParams['font.family'] = 'TH Sarabun New'
    plt.rcParams['axes.unicode_minus'] = False

setup_thai_font()

# =====================================================================
# ⚙️ 2. ฐานข้อมูลตั้งต้น (Default Field Survey Data)
# =====================================================================
DEFAULT_DATA = [
    ("Depot โรงจัดการขยะ", 14.862939, 102.027903, 0),
    ("ภูมิทัศน์(ใหม่)", 14.86903, 102.02135, 0.3),
    ("สวนพฤกษศาสตร์", 14.86991, 102.022113, 0.3),
    ("อุทยานผีเสื้อ", 14.871074, 102.022713, 0.3),
    ("ซินโครตรอน", 14.872731, 102.023232, 0),
    ("อาคารสุรพัฒน์ 2", 14.8754, 102.02286, 0.2),
    ("อาคารสุรพัฒน์ 3", 14.874078, 102.022316, 0.4),
    ("เรือนไทย", 14.875346, 102.021912, 0.3),
    ("อาคารสุรพัฒน์ 1 จุดที่ 1", 14.87584, 102.02302, 0.2),
    ("อาคารสุรพัฒน์ 1 จุดที่ 2", 14.87572, 102.02284, 0.2),
    ("เซเว่น-อีเลฟเว่น เทคโนธานี จุดที่ 1", 14.876072, 102.022745, 0.7),
    ("เซเว่น-อีเลฟเว่น เทคโนธานี จุดที่ 2", 14.876125, 102.022341, 0.4),
    ("ร้านคอกาแฟ ข้าง 7-11 เทคโนธานี", 14.876938, 102.022377, 0.1),
    ("อาคารสุรสัมนาคาร", 14.876533, 102.024665, 0),
    ("โรงอาหารครัวท่านท้าว", 14.877234, 102.02026, 0.2),
    ("อาคารวิจัยมันสำปะหลัง", 14.874527, 102.020047, 0.2),
    ("หอดูดาว", 14.87414, 102.027598, 0.2),
    ("กาญจนาภิเษก", 14.873602, 102.026147, 0.5),
    ("กัญชา (สวนเกษตรอินทรีย์)", 14.871656, 102.026088, 0.4),
    ("สุรนิทัศน์", 14.871756, 102.024782, 0.2),
    ("อุทยานวิทยาศาสตร์", 14.87176, 102.01974, 0.3),
    ("อาคารงานภูมิทัศน์(เก่า)", 14.87273, 102.01824, 0.1),
    ("อาคารทดลอง-รถไฟ", 14.87422, 102.01791, 0.1),
    ("เครื่องมือฯ9", 14.87516, 102.01613, 0.1),
    ("ร้านกาแฟเด็กชายนมสด อาคารเครื่องมือ 9", 14.87412, 102.01637, 0.1),
    ("เครื่องมือฯ11", 14.87561, 102.01656, 0.1),
    ("เครื่องมือฯ12", 14.873347, 102.01454, 0),
    ("ร้านกาแฟ Polar Polar อาคารเครื่องมือ 12", 14.87458, 102.01527, 0.1),
    ("เครื่องมือฯ 16 (ฝั่งตรงข้าม อาคารเครื่องมือ 12)", 14.87456, 102.01447, 0.2),
    ("เครื่องมือฯ10", 14.876915, 102.015231, 0.
